console.log('number' + 3 + 3); 
// 1. 'number' + 3 дає 'number3' (коли рядок об'єднується з числом, число перетворюється на рядок)
// 2. 'number3' + 3 дає 'number33' (число 3 перетворюється на рядок і додається до 'number3')


console.log(null + 3);
//null приводиться до числового значення 0. Далі просто:0+3=3

console.log(5 && "qwerty");
//5 і qwerty є істинними значеннями. Оператор && повертає останнє істинне значення, якщо обидва операнди є істинними,тому результатом буде "qwerty".

console.log(+'40' + +'2' + "hillel");
//1. +'40' дає 40 (унарний плюс перетворює рядок у число).
//2. +'2' дає 2 (унарний плюс перетворює рядок у число).
//3. + 2 дає 42 (арифметичне додавання).
//4. + "hillel" дає "42hillel" (число 42 перетворюється на рядок і додається до "hillel"). Тому маємо такий результат

console.log('10' - 5 === 6);
//1. Тут рядок '10' приводиться до числа, тому спочатку отримуємо 10 - 5 = 5
//2. Далі перевірка на рівність: 5===6. Числа не рівні, тому результат false

console.log(true + false);
//1. true це 1, false це 0. 
//2. 1 + 0 = 1

console.log('4px' - 3);
//1. '4px' не можна перетворити на число, тому результат операції буде NaN.
//2.  NaN - 3 = NaN, тому що будь-яка операція з NaN дає NaN.

console.log('4' - 3);
// 1. Спочатку рядок '4' приводиться до числа.
// 2. Далі 4 - 3 дає 1 (просте віднімання).

console.log('6' + 3 ** 0);
//1. 3 ** 0 перетворює "3" в степінь "0". А будь-яке число в степені 0 = 1.
//2. '6' + 1 дає '61', тому що число 1 перетворюється на рядок і додається до '6'.

console.log(12 / '6');
//1. '6' дає 6 (рядок '6' приводиться до числа).
//2. 12 / 6 дає 2 (арифметичне ділення).

console.log('10' + (5 === 6));
//1. 5 === 6 дає false (непройдено перевірку на рівність).
//2. '10' + false дає '10false' (значення false перетворюється на рядок).

console.log(null == '');
// null не може дорівнювати пустому рядку, тому результатом є false 

console.log(3 ** (9 / 3));
//1. 9 / 3 дає 3 (арифметичне ділення).
//2. 3 ** 3 підносить 3 у ступінь 3, то результатом є 27.

console.log(!!'false' == !!'true');
//1. !!'false' є true (будь-який непустий рядок є true).
//2. !!'true' також є true (аналогічно).
//3. true == true, тому результат true (просто порівняння).

console.log(0 || '0' && 1);
//1. '0' && 1 дає 1 (останнє істинне значення).
//2. 0 || 1 дає 1 (перший істинний операнд).

console.log((+null == false) < 1);
//1. Коли застосовуємо + до null, результатом буде 0, оскільки null перетворюється в 0.
//2. 0 == false дає true Тут ми порівнюємо 0 з false за допомогою  "==". Тому false у числовому контексті також перетворюється в 0
//3. true < 1 дає false, бо true завджи рівне 1 

console.log(false && true || true);
//1. false && true -> false (операція && з false завжди повертає false).
//2. false || true -> true (операція || з true повертає true).

console.log(false && (false || true));
//1. false || true дає true (операція || з true повертає true).
//2. false && true дає false (операція && з false завжди повертає false).

console.log((+null == false) < 1 ** 5);
//1. +null перетворює null на число, а null у числовому виразі рівний 0
//2. 0 == false дає true, бо false перетворюється в 0 під час порівняння з числом
//3. 1 ** 5 дає 1. Бо 1 в ступіні 5 = 1
//4. "true < 1 ** 5" теж саме що 1 < 1 дає false 